# Mini Project

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\prashanthi\Downloads\weather_data.csv")

In [4]:
df

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy
5  06-01-2025        Mumbai             33          59     Rainy
6  07-01-2025       Chennai             34          61     Sunny
7  08-01-2025    Rajamundry             32          63    Cloudy
8  09-01-2025         Eluru             31          64     Rainy
9  10-01-2025    Anakapalli             29          62     Sunny

In [5]:
df.head()

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [6]:
df.tail()

         Date        City  Temperature_C  Humidity_% Condition
5  06-01-2025      Mumbai             33          59     Rainy
6  07-01-2025     Chennai             34          61     Sunny
7  08-01-2025  Rajamundry             32          63    Cloudy
8  09-01-2025       Eluru             31          64     Rainy
9  10-01-2025  Anakapalli             29          62     Sunny

In [8]:
df.shape

(10, 5)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     object
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [10]:
df[2:5]

         Date          City  Temperature_C  Humidity_% Condition
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [11]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [13]:
df.dtypes

Date             object
City             object
Temperature_C     int64
Humidity_%        int64
Condition        object
dtype: object

In [15]:
df.Date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
7    08-01-2025
8    09-01-2025
9    10-01-2025
Name: Date, dtype: object

In [16]:
df['Date']

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
7    08-01-2025
8    09-01-2025
9    10-01-2025
Name: Date, dtype: object

In [17]:
df['Date'][df['Condition']=='Rainy']

4    05-01-2025
5    06-01-2025
8    09-01-2025
Name: Date, dtype: object

# exploring data

In [18]:
ai=pd.DataFrame({
    "name":["prashanthi","devi","ramya"],
    "age":[23,25,30]
})
ai

         name  age
0  prashanthi   23
1        devi   25
2       ramya   30

In [19]:
ds=pd.DataFrame({
    "name":["pritham","nikki","ramya"],
    "age":[30,25,35]
})
ds

      name  age
0  pritham   30
1    nikki   25
2    ramya   35

In [20]:
a=pd.merge(ai,ds,on='name')
a

    name  age_x  age_y
0  ramya     30     35

In [21]:
df=pd.concat([ai,ds],ignore_index=True)
df

         name  age
0  prashanthi   23
1        devi   25
2       ramya   30
3     pritham   30
4       nikki   25
5       ramya   35